zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/timer_reg.h
#define TIMER_PWMIFA_IFASEL_Pos          (28)                                              /*!< TIMER_T::PWMIFA: IFASEL Position       */
#define TIMER_PWMIFA_IFASEL_Msk          (0x3ul << TIMER_PWMIFA_IFASEL_Pos)                /*!< TIMER_T::PWMIFA: IFASEL Mask           */

#define TIMER_PWMIFA_IFAEN_Pos           (31)                                              /*!< TIMER_T::PWMIFA: IFAEN Position        */
#define TIMER_PWMIFA_IFAEN_Msk           (0x1ul << TIMER_PWMIFA_IFAEN_Pos)                 /*!< TIMER_T::PWMIFA: IFAEN Mask            */

#define TIMER_PWMAINTSTS_IFAIF_Pos       (0)                                               /*!< TIMER_T::PWMAINTSTS: IFAIF Position    */
#define TIMER_PWMAINTSTS_IFAIF_Msk       (0x1ul << TIMER_PWMAINTSTS_IFAIF_Pos)             /*!< TIMER_T::PWMAINTSTS: IFAIF Mask        */

#define TIMER_PWMAINTEN_IFAIEN_Pos       (0)                                               /*!< TIMER_T::PWMAINTEN: IFAIEN Position    */
#define TIMER_PWMAINTEN_IFAIEN_Msk       (0x1ul << TIMER_PWMAINTEN_IFAIEN_Pos)             /*!< TIMER_T::PWMAINTEN: IFAIEN Mask        */

#define TIMER_PWMAPDMACTL_APDMAEN_Pos    (0)                                               /*!< TIMER_T::PWMAPDMACTL: APDMAEN Position */
#define TIMER_PWMAPDMACTL_APDMAEN_Msk    (0x1ul << TIMER_PWMAPDMACTL_APDMAEN_Pos)          /*!< TIMER_T::PWMAPDMACTL: APDMAEN Mask     */

#define TIMER_PWMEXTETCTL_EXTETEN_Pos    (0)                                               /*!< TIMER_T::PWMEXTETCTL: EXTETEN Position */
#define TIMER_PWMEXTETCTL_EXTETEN_Msk    (0x1ul << TIMER_PWMEXTETCTL_EXTETEN_Pos)          /*!< TIMER_T::PWMEXTETCTL: EXTETEN Mask     */

#define TIMER_PWMEXTETCTL_CNTACTS_Pos    (4)                                               /*!< TIMER_T::PWMEXTETCTL: CNTACTS Position */
#define TIMER_PWMEXTETCTL_CNTACTS_Msk    (0x3ul << TIMER_PWMEXTETCTL_CNTACTS_Pos)          /*!< TIMER_T::PWMEXTETCTL: CNTACTS Mask     */

#define TIMER_PWMEXTETCTL_EXTTRGS_Pos    (8)                                               /*!< TIMER_T::PWMEXTETCTL: EXTTRGS Position */
#define TIMER_PWMEXTETCTL_EXTTRGS_Msk    (0xful << TIMER_PWMEXTETCTL_EXTTRGS_Pos)          /*!< TIMER_T::PWMEXTETCTL: EXTTRGS Mask     */

/** @} TIMER_CONST */
/** @} end of TIMER register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __TIMER_REG_H__ */
